"""
1. У вас есть массив чисел, составьте из них максимальное число. Например:
 [61, 228, 9] -> 961228
"""

"""
2. Взять код, который писали для игры кубики на лекции 7 https://github.com/VitaliiFisenko95/python_lk/blob/master/lk7/class_work.py#L150 ,
проанализировать его (по возможности улучшить). Результат игры в кубики нужно записать в файл (json, yaml, csv, xlsx) по раундам. 
В данных раунда должно быть:
 - время хода каждого из игроков
 - количество очков за раунд
 - номер игрока (или имя)
"""

"""
3. Реализовать функцию, которая принимает строку и расделитель и возвращает словарь {слово: количество повторений} 
(частотный словарь)
"""


def converter(string, separator):
    # write your code here
    pass


my_str = input('String')
delimiter = input('delimiter')

print(converter(my_str, delimiter))
