"""
1. Напишите программу, которая принимает имя файла и выводит его расширение.
    Если расширение у файла определить невозможно, выбросите исключение.
"""



"""
2. Напишите программу, которая выводит чётные числа из заданного списка и останавливается, если встречает число 237.
"""

numbers = [
    386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345,
    399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217,
]


"""
3. Напишите программу, которая принимает текст и выводит два слова: наиболее часто встречающееся и самое длинное.
"""