"""
1.Реализовать класс фигуры. На основе фигуры реализовать класс треугольника, квадрата и прямоугольника с
методами подсчета площади и периметра. Методы должны возвращать (return) значение, а не принтить (это важно)
"""

"""
2.Реализовать класс Person, у которого должно быть два атрибута: age и name. 

Также у него должен быть следующий набор методов:

    1.def know(self, another_person_object)
    который позволяет добавить другого человека в список знакомых (лист __friends (обязательно приватный атрибут)).

    2.def is_known(self, another_person_object)
    который возвращает знакомы ли два человека (True/False)
    
"""