"""
1. Реализовать калькулятор, как делали на прошлом дз, но уже с обработкой ошибок (try, except)
"""

"""
2. Нужно сделать что бы код не падал, а был обработан каждый случай в отдельном except.
 На код стоит посмотреть внимательно, может что-то в нем не так)
"""
import random

 raise random.choice([ZeroDivisionError, ImportError, KeyError, UnicodeError, StopIteration])




"""
3. Совместить валидацию email и валидацию пароля и вместо принтов райзить ошибки если пароль или 
email не подходит по критериям (критерии надежности пароля можно брать с прошлого ДЗ или придумать новые). 
Ошибки брать на выбор 
"""

"""
4. Создать список, где все элементы будут кратные 5ти (упражнение на функцию range)
"""


"""
5. Вывести в консоль (функция print) максимальное и минимальное значение из списка в задании 4 и сумму всех елементов 
этого списка
"""