"""
1. Разминочная задача на ввод/вывод.
    Написать программу, которая запросит у
    пользователя что-то, а потом выведет
    результат в консоль.
"""

"""
2. Валидатор паролей. На занятии делали валидацию емейла, тут 
    нужно сделать валидацию пароля по такому же принципу.
    Придумать критаерии надежного пароля, описать их в условиях.
"""


"""
3. Дописать калькулятор, добавив операции умножения, деления, целочисленного деления и возведения в квадрат. 
    Обязательно программа должна обрабатывать тонкие места и не падать
"""